# LineColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..LineColor Property
Category Class See Also
---
The color of lines shown for elements of this category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Color LineColor { get; set; }
```

Visual Basic
---
```text
Public Property LineColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ LineColor {
	Color^ get ();
	void set (Color^ value);
}
```

# See Also
Category Class
Autodesk.Revit.DB Namespace